thomas-engineering/weather_display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Silicon revision profile. This board's P4 reports rev v1.3, so it takes the
# vendor's `rev1_3` profile (config/esp32p4_rev1_3.defaults in the BSP repo):
# pre-v3 plus REV_MIN_100. ESP-IDF's minimum-revision setting has 1.0 granularity,
# so REV_MIN_100 is correct here and does not claim the minimum is exactly 1.3.
# Firmware built for the two profiles is NOT interchangeable — a rev3_x image is
# refused by rev1.3 silicon at flash time. For a rev3.x board, swap these two for
# `# CONFIG_ESP32P4_SELECTS_REV_LESS_V3 is not set` + CONFIG_ESP32P4_REV_MIN_300=y.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Real OTA (main/ota_update.c): roll back to the previous ota_x slot if the
# new image is never marked valid (esp_ota_mark_app_valid_cancel_rollback(),
# called from ota_update_resume_after_boot() once Wi-Fi/UI are confirmed up).
# CONFIG_APP_ROLLBACK_ENABLE is a deprecated/no-op alias in this IDF version
# (see components/bootloader/Kconfig.app_rollback) — this is the real switch.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM: the triple-buffered 1024x600 framebuffers and the HTTP body live here.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Keep internal RAM free for DMA. On the P4, PSRAM carries no MALLOC_CAP_DMA,
# so the only memory the ESP-Hosted SDIO link to the C6 can use is the ~384 KiB
# of internal RAM — and it allocates one 1536-byte buffer per packet, in both
# directions, from the ordinary heap. At the IDF default of 16384 every malloc
# up to 16 KiB goes to internal RAM first (heap_caps_malloc_default()), so
# lwip pbufs, mbedtls buffers and HTTP buffers all compete for exactly that
# memory. They fall back to PSRAM when it runs out; a MALLOC_CAP_DMA request
# cannot, it just fails and the packet is dropped — which is how a stalled OTA
# download ended up wedging the RPC channel to the co-processor.
# See review/ota-sdio-buffer-2026-09-22.md.
# 1024 is deliberately below a typical ~1.5 KB pbuf. Safe here because the
# Wi-Fi driver itself runs on the C6: the host needs internal DMA memory only
# for the SDIO buffers, which lwip copies into anyway.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# HTTPS to api.open-meteo.com via the bundled root CA store.
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# mbedtls allocates from PSRAM, for the same reason as the SPIRAM settings
# above: its session buffers (CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN is 16 KiB) are
# the largest single consumer during an OTA download, and every byte of them
# in internal RAM is a byte the SDIO link cannot have.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set

# Every size weather_ui.c references. Missing any one of these is a link error.
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"

CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_LINE=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_WEATHER_USE_INTER_FONTS=y

# Ambient-light sensing via the optional OV5647 on the MIPI-CSI connector.
# ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE/_ISP_VIDEO_DEVICE already default to y
# on P4 (SOC_MIPI_CSI_SUPPORTED/SOC_ISP_SUPPORTED) once esp_video is a
# dependency; spelled out here so the choice isn't silent. CAMERA_OV5647's own
# default (RAW8 800x800 @ 50fps, auto-detected over SCCB at esp_video_init())
# is used as-is — app_light.c only needs *a* frame to average, not a specific
# resolution.
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_CAMERA_OV5647=y

# Already IDF's own default (y) - spelled out here because app_weather.c's
# http_get() now calls mbedtls_strerror() to decode the raw hex codes esp-tls
# logs on TLS handshake failure (e.g. "-0x008D"), seen repeatedly during the
# touch-latency hardware experiments. Without this, mbedtls_strerror() is a
# stub that always writes an empty string.
CONFIG_MBEDTLS_ERROR_STRINGS=y

# SNTP's startup delay waits a random 0-5s before the first request (meant to
# spread load when a whole fleet reboots at once). One display on a home
# network doesn't need that, and the clock has to be set before the boot-time
# weather fetch (see STARTUP_SNTP_WAIT_MS in main/app_weather.c).
# CONFIG_LWIP_SNTP_STARTUP_DELAY is not set
